In [7]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

df = pd.read_excel('nuevos/TMA20-002.xls', sheet_name='PLANTILLA', skiprows=5, header = None)
df.drop(df.columns[[0,6]], axis=1, inplace = True)

In [17]:
import os
tmas = []
for root, dirs, files in os.walk("nuevos"):
    for file in files:
        if file.endswith(".xls"):
            df = pd.read_excel(f'nuevos/{file}', sheet_name='PLANTILLA', skiprows=5, header = None)
            df.drop(df.columns[[0,6]], axis=1, inplace = True)
            print(df.shape)
            s = df.T.reset_index().reindex(columns=[1,0,'index'])
            s = df.T
            s = df.T.reset_index().reindex(columns=[7,6,5,4,3,2,1,0,'index'])
            s.drop(columns = ['index'], inplace = True)
            s.to_csv('_' + file, header=None, index = None)
            #tmas.append(tma)

(8, 10)
(8, 10)
(8, 10)
(8, 10)
(8, 10)
(8, 10)

In [9]:
df

     1     2     3     4     5     7     8     9     10    11
0  2017  2018  2022  2023  2025  2017  2018  2022  2023  2025
1  2028  3038  3063  4005  4007  2028  3038  3063  4005  4007
2  1014  4015  4018  4039  4040  1014  4015  4018  4039  4040
3  4041  4042  4048  4063  4064  4041  4042  4048  4063  4064
4  4065  5001  5002  5003  5005  4065  5001  5002  5003  5005
5  5008  5009  5010  5011  5013  5008  5009  5010  5011  5013
6  5014  5016  5017  5019  5020  5014  5016  5017  5019  5020
7  5024  5026  5031  5033  5034  5024  5026  5031  5033  5034

In [10]:
df.shape

(8, 10)

In [333]:
path = "DTS2019/PLANTILLAS/"
TMA = 'TMA14-006.xls'

In [344]:
df = pd.read_excel(path + TMA, sheetname='PLANTILLA', skiprows=6, header = None)

/home/auri/anaconda3/lib/python3.6/site-packages/pandas/io/excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

In [345]:
df.drop(df.columns[[0,1,6,7]], axis=1, inplace = True)

In [346]:
df.shape

(8, 8)

In [347]:
df

,2,3,4,5,8,9,10,11
0,06-5803-11,06-5879-15,06-5884-1,06-6340-14,06-5803-11,06-5879-15,06-5884-1,06-6340-14
1,06-6798-6,06-9873-18,06-9926-8,06-10175-20,06-6798-6,06-9873-18,06-9926-8,06-10175-20
2,06-10268-11,06-10993-1,06-11839-5,06-12247-4,06-10268-11,06-10993-1,06-11839-5,06-12247-4
3,06-12585-6,06-12713-19,06-12748-5,06-13094-4,06-12585-6,06-12713-19,06-12748-5,06-13094-4
4,06-13251-4,06-13666-3,06-14108-5,06-14535-9,06-13251-4,06-13666-3,06-14108-5,06-14535-9
5,06-14535-5,06-15750-2,06-15822-9,07-1268-B,06-14535-5,06-15750-2,06-15822-9,07-1268-B
6,07-3015-8,07-3277-6,07-3553-3,07-960-13,07-3015-8,07-3277-6,07-3553-3,07-960-13
7,NaN,NaN,NaN,07-10250-1,NaN,NaN,NaN,07-10250-1

In [11]:
s = df.T.reset_index().reindex(columns=[1,0,'index'])

In [12]:
s = df.T

In [13]:
s = df.T.reset_index().reindex(columns=[7,6,5,4,3,2,1,0,'index'])
s

      7     6     5     4     3     2     1     0  index
0  5024  5014  5008  4065  4041  1014  2028  2017      1
1  5026  5016  5009  5001  4042  4015  3038  2018      2
2  5031  5017  5010  5002  4048  4018  3063  2022      3
3  5033  5019  5011  5003  4063  4039  4005  2023      4
4  5034  5020  5013  5005  4064  4040  4007  2025      5
5  5024  5014  5008  4065  4041  1014  2028  2017      7
6  5026  5016  5009  5001  4042  4015  3038  2018      8
7  5031  5017  5010  5002  4048  4018  3063  2022      9
8  5033  5019  5011  5003  4063  4039  4005  2023     10
9  5034  5020  5013  5005  4064  4040  4007  2025     11

In [351]:
s.to_csv('_' + TMA)